<?php

/**
 * Правила транскрибирования русских букв:
 * https://yandex.ru/support/nmaps/app_transliteration.html
 */

namespace Mrheoh\Slugger\Interface;

class Yandex implements SluggerInterface
{
    /**
     * @return string[]
     */
    public function rules(): array
    {
        return [
            "Є" => "YE",
            "І" => "I",
            "Ѓ" => "G",
            "і" => "i",
            "№" => "#",
            "є" => "ye",
            "ѓ" => "g",
            "₽" => "R",
            "@" => "at",

            // окончания
            "ЪЕ" => "YE",
            "ЫЙ" => "IY",
            "ИЙ" => "IY",

            "А" => "A",
            "Б" => "B",
            "В" => "V",
            "Г" => "G",
            "Д" => "D",
            "Е" => "E",
            "Ё" => "YO",
            "Ж" => "ZH",
            "З" => "Z",
            "И" => "I",
            "Й" => "J",
            "К" => "K",
            "Л" => "L",
            "М" => "M",
            "Н" => "N",
            "О" => "O",
            "П" => "P",
            "Р" => "R",
            "С" => "S",
            "Т" => "T",
            "У" => "U",
            "Ф" => "F",
            "Х" => "KH",
            "Ц" => "TS",
            "Ч" => "CH",
            "Ш" => "SH",
            "Щ" => "SCH",
            "Ъ" => "'",
            "Ы" => "Y",
            "Ь" => "",
            "Э" => "E",
            "Ю" => "YU",
            "Я" => "YA",

            // окончания
            "ъе" => "ye",
            "ый" => "iy",
            "ий" => "iy",

            "а" => "a",
            "б" => "b",
            "в" => "v",
            "г" => "g",
            "д" => "d",
            "е" => "e",
            "ё" => "yo",
            "ж" => "zh",
            "з" => "z",
            "и" => "i",
            "й" => "j",
            "к" => "k",
            "л" => "l",
            "м" => "m",
            "н" => "n",
            "о" => "o",
            "п" => "p",
            "р" => "r",
            "с" => "s",
            "т" => "t",
            "у" => "u",
            "ф" => "f",
            "х" => "kh",
            "ц" => "ts",
            "ч" => "ch",
            "ш" => "sh",
            "щ" => "sch",
            "ъ" => "",
            "ы" => "y",
            "ь" => "",
            "э" => "e",
            "ю" => "yu",
            "я" => "ya",

            "«" => "",
            "»" => "",
            "–" => "-",
            "—" => "-",
            "/" => "-",
            "\\" => "-",
            " " => "-",
            "." => "",
        ];
    }
}
